package lukianov.belochka;

/**
 * Представляет существо, заточенное под сбор орешков с орешников.
 * <p>
 * Реализации этого интерфейса определяют, как именно собираются орехи,
 * и какие сверхспособности проявляют эти существа.
 * </p>
 */
public interface NutGatherer {
    /**
     * Проводит сбор орехов с указанного орешника. Реализация метода скорее
     * всего должна обеспечивать опустошение списка орехов дерева после сбора.
     *
     * @param tree дерево ({@link Oreshnik}), с которого собираются орехи.
     */
    void gatherFromTree(Oreshnik tree);

    /**
     * Показывает сверхспособность существа. Как правило, такая способность
     * заключается в браваде по поводу своих успехов.
     */
    void showSuperpower();
}
