package lukianov.belochka;

import java.util.ArrayList;
import java.util.List;
import java.util.Random;
import java.util.stream.IntStream;

/**
 * Модель дерева-орешника, производящего орехи ({@link Oreshek}) соответственно своему уровню.
 * <p>
 * Уровень дерева определяет максимальный выход орехов за сезон.
 * При создании объекта уровень либо задаётся явно через конструктор {@link #Oreshnik(int)},
 * либо генерируется случайным образом (от 3 до 11 включительно) через конструктор
 * по умолчанию {@link #Oreshnik()}.
 * <p>
 * Орехи выращиваются методом {@link #growNuts()}, если на дереве нет ни одного ореха.
 * Количество выращенных орехов определяется случайно и не превышает текущий уровень дерева.
 * <p>
 * Уровень дерева может повышаться на 1 с помощью метода {@link #upgrade()}.
 */
public class Oreshnik {
    /**
     * Фактор генетики, определяющий максимальную урожайность дерева при создании.
     */
    private static final Random genetics = new Random();
    /**
     * Фактор климата, определяющий количество выросших орехов в конкретном сезоне.
     */
    private static final Random weather = new Random();
    /**
     * Уровень дерева, определяющий максимальный выход орехов за сезон.
     */
    private int level;
    /**
     * Список орешков, выросших на орешнике и доступных для сбора сборщиками орехов.
     */
    private final List<Oreshek> oreshki = new ArrayList<>();


    /**
     * Повышает уровень дерева на единицу, увеличивая тем самым
     * потенциальный выход орехов за сезон.
     */
    public void upgrade() {
        level++;
    }

    /**
     * Обеспечивает доступность орешков, выросших на дереве.
     *
     * @return изменяемый список объектов {@link Oreshek}; в моменте может быть пустым,
     *         если орехи ещё не выращены
     */
    public List<Oreshek> getOreshki() {
        return oreshki;
    }

    /**
     * Возвращает текущий уровень дерева.
     *
     * @return уровень дерева, определяющий максимальный выход орехов за сезон
     */
    public int getLevel() {
        return level;
    }

    /**
     * Выращивает орешки на Орешнике. Если однако на дереве есть хотя бы один орешек,
     * то ничего не делает.
     * <p>
     * Количество вырастающих орехов случайно определяется погодными факторами
     в диапазоне (включительно) от {@code 0} до текущего уровня дерева ({@code level}).
     */
    public void growNuts() {
        if (oreshki.isEmpty()) {
            int production = weather.nextInt(level + 1);
            IntStream.range(0, production)
                    .forEach(_ -> oreshki.add(new Oreshek()));
        }
    }

    /**
     * Создаёт новый экземпляр Орешника с указанным уровнем урожайности.
     *
     * @param level начальный уровень, устанавливаемый этому экземпляру.
     */
    public Oreshnik(int level) {
        this.level = level;
    }

    /**
     * Создает новый экземпляр Орешника со случайным стартовым уровнем
     * урожайности, выбранным из диапазона от {@code 3} до {@code 12}.
     */
    public Oreshnik() {
        this(genetics.nextInt(9) + 3);
    }


}
