public class YakovlevTusk4 {
    static void main(String[] args) {
        Дерево дерево = new Дерево();
        Белочка белочка = new Белочка("Стрелка");

        System.out.println("--- Начало демонстрации ---");

        Орешек[] корзинаОрехов = дерево.выраститьМассивОрехов(15);

        белочка.собратьОрехи(корзинаОрехов);

        System.out.println("--- Конец демонстрации ---");
    }
}

class Орешек {
    private final double вес;
    public Орешек() {
        this.вес = 12.5;
    }

    public double getВес() {
        return вес;
    }
}

class Дерево {
    public Орешек[] выраститьМассивОрехов(int количество) {
        System.out.println("Дерево вырастило " + количество + " сочных орешков.");
        Орешек[] массив = new Орешек[количество];

        for (int i = 0; i < количество; i++) {
            массив[i] = new Орешек();
        }
        return массив;
    }
}

class Белочка {
    private String имя;

    public Белочка(String имя) {
        this.имя = имя;
    }

    public void собратьОрехи(Орешек[] орехи) {
        System.out.println("Белочка " + имя + " приступает к сбору орехов...");
        double общийВес = 0.0;

        for (int i = 0; i < орехи.length; i++) {
            System.out.println("Ура, еще орех!");
            общийВес += орехи[i].getВес(); // Суммируем вес
        }

        // Гордое сообщение об общем весе
        System.out.printf("\n[Белочка %s]: Я гордо сообщаю, что насобирала общий вес: %.1f грамм!\n\n", имя, общийВес);
    }
}
